modules/beakstar/mod-ivy/literate-config.org
#+TITLE: mod-ivy
:properties:
#+OPTIONS: toc:nil author:nil timestamp:nil num:nil ^:nil
#+HTML_HEAD_EXTRA: <style> .figure p {text-align: left;} </style>
#+HTML_HEAD_EXTRA: <style> table, th, td {border: solid 1px; font-family: monospace;} </style>
#+HTML_HEAD_EXTRA: <style> td {padding: 5px;} </style>
#+HTML_HEAD_EXTRA: <style> th.org-right {text-align: right;} th.org-left {text-align: left;} </style>
#+startup: shrink
:end:

* Custom ivy-switch-buffer

I don't love workspaces and I also like to be able to see the buffers I care about easily while ignoring many of the utility / specifal buffers. This lets me do that easily and in a custom way.

#+begin_src emacs-lisp
(defun beakstar-ivy-switch-buffer ()
  "Calls ivy-switch-buffer ignoring any buffers in beakstar-ivy-switch-buffers-ignore-names
or that match a regex in beakstar-ivy-switch-buffers-ignore-regexes.
Calling it with the universal argument will show all buffers."
  (interactive)
  (if current-prefix-arg
      (ivy-switch-buffer)
    (let ((ivy-ignore-buffers (append
                               less-important-buffer-names)))
      (ivy-switch-buffer))))
#+end_src

* Keymaps

#+begin_src emacs-lisp
(map! :desc "Switch to buffer" :leader "," #'beakstar-ivy-switch-buffer)
#+end_src

* Patch to fix "Error in post-command-hook (ivy--queue-exhibit)..."

From: https://github.com/Yevgnen/ivy-rich/issues/115
This is an issue in ivy-rich, doom hasn't updated yet.

#+begin_src emacs-lisp
(after! ivy (defun ivy-rich--switch-buffer-directory! (orig-fun &rest args)
              (cl-letf (((symbol-function 'directory-file-name) #'file-name-directory))
                (apply orig-fun args)))
  (advice-add 'ivy-rich--switch-buffer-directory :around #'ivy-rich--switch-buffer-directory!))
#+end_src
